--- a/Multi/README.md
+++ b/Multi/README.md
@@ -94,88 +94,93 @@ reg_write_addr = 1 -> instr[15:11]
 reg_write_data = 0 -> alu result  
 reg_we = 1
 
-```plantuml
-state "S0: Fetch" as S0
-state "S1: Decode" as S1
-state "S2: Jump" as S2
-state "S3: LWorSW" as S3
-state "S4: LWMemRead" as S4
-state "S5: SWMemWrite" as S5
-state "S6: LWRegWrite" as S6
-state "S7: Beq" as S7
-state "S8: Bne" as S8
-state "S9: Addi" as S9
-state "S10: Andi" as S10
-state "S11: Ori" as S11
-state "S12: Jr" as S12
-state "S13: ShiftLL" as S13
-state "S14: ShiftRL" as S14
-state "S15: ShiftRA" as S15
-state "S16: RType" as S16
-state "S17: AluWriteBack" as S17
-state "S18: AluWriteBackImm" as S18
-state "S00: nextFetch" as S00
+```mermaid
+stateDiagram-v2
+    state "S0: Fetch" as S0
+    state "S1: Decode" as S1
+    state "S2: Jump" as S2
+    state "S3: LWorSW" as S3
+    state "S4: LWMemRead" as S4
+    state "S5: SWMemWrite" as S5
+    state "S6: LWRegWrite" as S6
+    state "S7: Beq" as S7
+    state "S8: Bne" as S8
+    state "S9: Addi" as S9
+    state "S10: Andi" as S10
+    state "S11: Ori" as S11
+    state "S12: Jr" as S12
+    state "S13: ShiftLL" as S13
+    state "S14: ShiftRL" as S14
+    state "S15: ShiftRA" as S15
+    state "S16: RType" as S16
+    state "S17: AluWriteBack" as S17
+    state "S18: AluWriteBackImm" as S18
+    state "S19: Jal" as S19
+    %% state "S00: nextFetch" as S00
+    
+    [*]-->S0
 
-S0 -> S1
-S1 -> S2
-' S2 ---> S0
-S1 -> S12: Op = R-Type and func = jr
-S1 --> S3: Op = sw or lw
-S3 --> S4: Op = lw
-S3 --> S5: Op = sw
-S4 --> S6
+    S0 --> S1
+    S1 --> S2
+    S1 --> S12: Op = R-Type, func = jr
+    S1 --> S3: Op = sw or lw
+    S3 --> S4: Op = lw
+    S3 --> S5: Op = sw
+    S4 --> S6
 
 
-S1 --> S7: Op = beq
-S1 --> S8: Op = bne
-S1 --> S9: Op = addi
-S1 --> S10: Op = andi
-S1 --> S11: Op = ori
-S1 --> S13: Op = R-Type and func = sll
-S1 --> S14: Op = R-Type and func = srl
-S1 --> S15: Op = R-Type and func = sra
-S1 --> S16: Op = R-Type
-S9 --> S18
-S10 --> S18
-S11 --> S18
+    S1 --> S7: Op = beq
+    S1 --> S8: Op = bne
+    S1 --> S9: Op = addi
+    S1 --> S10: Op = andi
+    S1 --> S11: Op = ori
+    S1 --> S13: Op = R-Type, func = sll
+    S1 --> S14: Op = R-Type, func = srl
+    S1 --> S15: Op = R-Type, func = sra
+    S1 --> S16: Op = R-Type
+    S1 --> S19: OP = jal
+    S9 --> S18
+    S10 --> S18
+    S11 --> S18
 
-' R-Type
-S13 --> S17
-S14 --> S17
-S15 --> S17
-S16 --> S17
+    S13 --> S17
+    S14 --> S17
+    S15 --> S17
+    S16 --> S17
 
-S6 --> S00
-S5 --> S00
-S7 --> S00
-S8 --> S00
-S17 --> S00
-S18 --> S00
+    S2 --> [*]
+    S5 --> [*]
+    S6 --> [*]
+    S7 --> [*]
+    S8 --> [*]
+    S17 --> [*]
+    S18 --> [*]
+    S19 --> [*]
 ```
 
 
 
